#+TITLE: Skeleton
#+AUTHOR: Joseph Edwards VIII

#+STARTUP: indent showall hideblocks
#+OPTIONS: toc:nil

* Skeleton
** Summary

*** Properties
:help:
The ~properties~ defined in this section should be treated like ~CONSTANTS~. They are referenced by other table formulas, and should be manually updated as the character evolves.

The ~attributes~ defined should be treated as mutable fields. They may be referenced by other tables, or may reference other tables, or may be manually updated, as needed.
:END:

#+NAME: properties
| Level | Class     | Race           | Background | Alignment |
|-------+-----------+----------------+------------+-----------|
|     1 | Barbarian | Mountain Dwarf | Folk Hero  | CG        |

*** Attributes

#+NAME: attributes
| XP | HP | AC | Prof | Insp | Init |
|----+----+----+------+------+------|
|  5 | 14 | 14 |    2 |    0 |    2 |
#+TBLFM: @2$3=remote(armor,@2$6)::@2$6=remote(abilities,@3$3)

*** Hit Points
:help:
Add numbers to the '-' column when you get hit. Add to the '+' column when you get healed.
To recompute, do ~C-u C-c *~ in the table (or ~C-c C-c~ the /first/ ~TBLFM~ formula).
To reset the table, do ~C-c C-c~ in the /second/ ~TBLFM~ formula.
:END:

#+NAME: hp-current
| Max | Temp | -             |    | +       |    | Δ | Current |
|-----+------+---------------+----+---------+----+---+---------|
|  14 |    0 | 0 7 1 1 3 5 2 | 19 | 0 7 8 7 | 22 | 3 |      14 |
#+TBLFM: @2$1=remote(attributes, @2$2)::@2$4='(org-sbe dnd-sum-cell (fl $@2$3))::@2$6='(org-sbe dnd-sum-cell (fl $@2$5))::@2$7=@2$6-@2$4::@2$8=max(0, min(@2$1+@2$2, @2$1+@2$2+@2$7))
#+TBLFM: @2$2=0::@2$3=0::@2$4=0::@2$5=0::@2$6=0::@2$7=0::@2$8=@2$1

**** Hit Dice

| HD (d12) | - |   | Current |
|----------+---+---+---------|
|        1 |   | 0 |       1 |
#+TBLFM: @2$3='(org-sbe dnd-sum-cell (fl $@2$2))::@2$4=@2$1-@2$3


*** Experience Points
:help:
Add numbers separated by spaces to the '+' column, so it looks like, for example, ~| 0 14 2 |~.
To recompute, do ~C-u C-c *~ with cursor in the table (or ~C-c C-c~ in the ~TBLFM~ formula).
:END:

#+NAME: xp-total
| Current | + |   |   | Total |
|---------+---+---+---+-------|
|       5 | 0 | 0 | 0 |     5 |
#+TBLFM: @2$1=remote(attributes, @2$1)::@2$3='(org-sbe dnd-sum-cell (fl $@2$2))::@2$4=vsum(remote(xp-items, @2$2..@>$2))::@2$5=@2$1+@2$3+@2$4

**** XP Tracking
:help:
Or track individual encounters. Leave empty when not tracking.
:END:

#+NAME: xp-items
| Foe(s) Defeated | XP Earned |
|-----------------+-----------|
|                 |           |


*** Abilities
:help:
This acts as a reference table for many other tables using ~org-lookup-first~.
:END:

#+NAME: abilities
| Ability | Score | Mod |
|---------+-------+-----|
| Str     |    20 |   5 |
| Dex     |    14 |   2 |
| Con     |    15 |   2 |
| Int     |    13 |   1 |
| Wis     |    12 |   1 |
| Cha     |    12 |   1 |
#+TBLFM: $3=floor(($2-10)/2)

*** Saving Throws
:help:
References the ~abilities~ table. Enable proficiency by changing ~0~ to ~1~ in the ~Prof~ column, and recompute the formula.
:END:

#+NAME: saving-throws
| Ability | Mod | Prof | Note | Total |
|---------+-----+------+------+-------|
| Str     |   5 |    1 |      |     7 |
| Dex     |   2 |    0 |      |     2 |
| Con     |   2 |    1 |      |     4 |
| Int     |   1 |    0 |      |     1 |
| Wis     |   1 |    0 |      |     1 |
| Cha     |   1 |    0 |      |     1 |
#+TBLFM: $2='(org-lookup-first $1 '(remote(abilities,@2$1..@>$1)) '(remote(abilities,@2$3..@>$3)))::$5=$2+($3*remote(attributes,@2$4))

*** Skills

#+NAME: skills
|   | Skill           | Abi | Adj | Note | Mod | Total |
|---+-----------------+-----+-----+------+-----+-------|
| 0 | Acrobatics      | Dex |   0 |      |   2 |     2 |
| 1 | Animal Handling | Wis |   0 |      |   1 |     3 |
| 0 | Arcana          | Int |   0 |      |   1 |     1 |
| 1 | Athletics       | Str |   0 |      |   5 |     7 |
| 0 | Deception       | Cha |   0 |      |   1 |     1 |
| 0 | History         | Int |   0 |      |   1 |     1 |
| 0 | Insight         | Wis |   0 |      |   1 |     1 |
| 1 | Intimidation    | Cha |   0 |      |   1 |     3 |
| 0 | Investigation   | Int |   0 |      |   1 |     1 |
| 0 | Medicine        | Wis |   0 |      |   1 |     1 |
| 0 | Nature          | Int |   0 |      |   1 |     1 |
| 0 | Perception      | Wis |   0 |      |   1 |     1 |
| 0 | Performance     | Cha |   0 |      |   1 |     1 |
| 0 | Persuasion      | Cha |   0 |      |   1 |     1 |
| 0 | Religion        | Int |   0 |      |   1 |     1 |
| 0 | Sleight of Hand | Dex |   0 |      |   2 |     2 |
| 0 | Stealth         | Dex |   0 |      |   2 |     2 |
| 1 | Survival        | Wis |   0 |      |   1 |     3 |
#+TBLFM: $6='(org-lookup-first $3 '(remote(abilities,@2$1..@>$1)) '(remote(abilities,@2$3..@>$3)))::$7=($1*remote(attributes,@2$4))+$4+$6

** Attacks

*** Armor Class

#+NAME: ac-total
| Base | Equip | Buff | Total |
|------+-------+------+-------|
|   14 |     1 |    6 |    20 |
#+TBLFM: @2$1=remote(attributes, @2$3)::@2$3=(@2$2*@2$3)+remote(abilities, @3$3)::@2$4=@2$1+@2$3

*** Weapons

| Name     |  Atk | Damage/Type | Status |
|----------+------+-------------+--------|
| Greataxe | 1d12 | slashing    |        |
| Handaxe  |  1d6 | slashing    |        |
| Handaxe  |  1d6 | slashing    |        |

*** Ammunition

#+NAME: ammo
| Name    | Qty | - |   | Current |
|---------+-----+---+---+---------|
| Javelin |   4 | 0 | 0 |       4 |
#+TBLFM: $4='(org-sbe dnd-sum-cell (fl $$3))::$5=$2-$4

*** Armor and Shield

#+NAME: armor
| Name       | Base AC | Dex | Note   | Equip | AC |
|------------+---------+-----+--------+-------+----|
| Hide Armor |      12 |   1 | medium |     1 | 14 |
#+TBLFM: @2$6=@2$2+(@2$3*remote(abilities,@3$3))

#+NAME: shield
| Name | Note | Equip | AC |
|------+------+-------+----|
|      |      |       |    |

** Inventory

#+NAME: coins
*** Coins
:help:
Use 2nd ~TBLFM~ to reset the ~Qty~ column equal to the ~Current~ and clear debits and credits.
:END:

| Coin | Qty |   - |   | + |   | Current |
|------+-----+-----+---+---+---+---------|
| CP   |   0 | 0 3 | 3 | 0 | 0 |      -3 |
| SP   |   0 |   0 | 0 | 0 | 0 |       0 |
| EP   |   0 |   0 | 0 | 0 | 0 |       0 |
| GP   |  13 | 0 1 | 1 | 0 | 0 |      12 |
| PP   |   0 |   0 | 0 | 0 | 0 |       0 |
#+TBLFM: $4='(org-sbe dnd-sum-cell (fl $$3))::$6='(org-sbe dnd-sum-cell (fl $$5))::$7=$2-$4+$6
#+TBLFM: $2=$7::$3=0::$4=0::$5=0::$6=0

*** Equipment

| Qty | Item            | Wt | Value | Status |
|-----+-----------------+----+-------+--------|
|   1 | Explorer's pack |    |       |        |
|   1 | Winter gear     | 5  |       |        |

Carrying capacity: Str*15


*** Backpack

| Qty | Item | Note | Value | Status |
|-----+------+------+-------+--------|
|     |      |      |       |        |

*** Treasure

|   Qty | Item | Note | Value |
|-------+------+------+-------|
| 20 92 | GP   |      |       |
|     4 | EP   |      |       |
|    76 | SP   |      |       |
|   125 | CP   |      |       |
|     7 | gem  | 10gp |       |

** Details
:help:
Reference items, like feats, may be referenced in other table formulas to modify values.
:END:

*** Features and Traits
- Tame Folk of the Elk Tribe, but outsider from Ten Towns - Gerund Elkhardt is King of the Elk - is cautious
- Folk Hero

*** Feats
-

*** Features
-

*** Tool Proficiencies:
-

** Spellcasting

*** Cantrips

Known: 0

| Name | Note | Ref |
|------+------+-----|
|      |      |     |

*** Spells

Known: 0

| Name | Level | Note | Ref | Used |
|------+-------+------+-----+------|
|      |       |      |     |      |


* Config :noexport:

** Get sum of field list

An expression to sum a string containing a space-separated list of numbers from a single table cell.

#+NAME: dnd-sum-cell
#+BEGIN_SRC emacs-lisp :var fl=""
  (apply '+ (mapcar 'string-to-number (split-string fl)))
#+END_SRC

Example:

#+begin_src emacs-lisp
  (org-sbe "dnd-sum-cell" (fl $"1 2 3 4"))
#+end_src

#+RESULTS:
: 10

** TODO Get min of value or sum of field list

#+NAME: dnd-min-sum-el
#+BEGIN_SRC emacs-lisp :var m=0 :var fl=""
  (min m (apply '+ (mapcar 'string-to-number (split-string fl))))
#+END_SRC

#+NAME: dnd-min-sum
#+BEGIN_SRC python :var m=0 :var fl="" :exports none
  l = map(int, fl.split())
  return min(int(m), sum(l))
#+END_SRC

Example:

#+BEGIN_SRC emacs-lisp
  (org-sbe "dnd-min-sum" (m 12) (fl $"0 1 2"))
#+END_SRC

#+RESULTS:
: 3


* Journal
